Merge pull request #1 from Saipramodh033/feature/benchmark-and-readme
Feature/benchmark and readme
